<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"6ad4dd63524bb8abee303783ffd6095994e3757d1851c7b1d12ab680b22c400f","plan_job_ref":"Job Staging Environment #98 at https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/12466082847","plan_out_hash":"c498b2b577f06155871cf0b9ad2e2a9db2eccb13d3ee6d962675cb4a4368c0e6","plan_hash":"bc53e76b775b5560e9bb02db58b1ad33fe1dd552a183fc7cf1ed8f4a69a7fea6","plan_text_format":"diff","version":"1.44.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 1 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.site-iam-policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "site-iam-policy" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:s3:::dev-portfolio-website-2.0",
+               "arn:aws:s3:::dev-portfolio-website-2.0/*",
            ]
+           sid       = "Allowing Cloudfront to access private S3 Bucket"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ",
                ]
+               variable = "AWS:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
!~  resource "aws_cloudfront_distribution" "s3_distribution" {
        id                              = "EOUIG3G6N7CQQ"
        tags                            = {}
#        (23 unchanged attributes hidden)

!~      viewer_certificate {
!~          cloudfront_default_certificate = false -> true
#            (4 unchanged attributes hidden)
        }

#        (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.site-bucket-policy will be updated in-place
!~  resource "aws_s3_bucket_policy" "site-bucket-policy" {
        id     = "dev-portfolio-website-2.0"
!~      policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = [
-                           "s3:ListBucket",
-                           "s3:GetObject",
                        ]
-                       Condition = {
-                           StringEquals = {
-                               "AWS:SourceArn" = "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "cloudfront.amazonaws.com"
                        }
-                       Resource  = [
-                           "arn:aws:s3:::dev-portfolio-website-2.0/*",
-                           "arn:aws:s3:::dev-portfolio-website-2.0",
                        ]
-                       Sid       = "Allowing Cloudfront to access private S3 Bucket"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # aws_s3_object.favicon will be created
+   resource "aws_s3_object" "favicon" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-portfolio-website-2.0"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "image/vnd.microsoft.icon"
+       etag                   = "76d48ad13d316d1eeecd3505b7a284e3"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "favicon.ico"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../web/favicon.ico"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.object will be updated in-place
!~  resource "aws_s3_object" "object" {
!~      etag                          = "b81d3203f3a853c1296810e9b9be0858" -> "0def9b4e97c034bd93fcff93d0d68ab2"
        id                            = "index.html"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (24 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Environment #98](https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/12466082847)